public class Maze {

    private static char ｐ = '　';
    private static char ｂ = '■';
    private static char ｔ = '¤';
    char[][] labyrinth = new char[][]{
            {ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ},
            {ｂ, ｐ, ｂ, ｂ, ｐ, ｐ, ｐ, ｔ, ｐ, ｂ, ｂ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｂ, ｂ},
            {ｂ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｐ, ｂ},
            {ｂ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｔ, ｂ},
            {ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｂ, ｂ, ｐ, ｂ, ｐ, ｂ},
            {ｂ, ｐ, ｐ, ｐ, ｐ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｐ, ｂ, ｐ, ｂ},
            {ｂ, ｐ, ｂ, ｂ, ｐ, ｐ, ｐ, ｐ, ｐ, ｂ, ｔ, ｐ, ｐ, ｐ, ｂ, ｐ, ｂ, ｐ, ｂ, ｂ, ｐ, ｐ, ｐ, ｂ},
            {ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｐ, ｂ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ},
            {ｂ, ｐ, ｂ, ｐ, ｐ, ｐ, ｐ, ｂ, ｐ, ｂ, ｐ, ｐ, ｐ, ｐ, ｂ, ｐ, ｂ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ},
            {ｂ, ｐ, ｂ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｐ, ｂ, ｐ, ｂ, ｐ, ｐ, ｂ, ｂ, ｂ},
            {ｂ, ｐ, ｂ, ｐ, ｂ, ｂ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｐ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ},
            {ｂ, ｐ, ｐ, ｐ, ｂ, ｂ, ｐ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｐ, ｐ, ｐ, ｐ, ｐ},
            {ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ, ｂ},
    };


    static void printLabyrinth(char[][] labyrinth) {
        int i = 0;
        while (i < labyrinth.length) {
            for (int j = 0; j < labyrinth[i].length; j++) {
                System.out.print(labyrinth[i][j] + " ");
            }
            System.out.println();
            i++;
        }
    }
}
